In [1]:
import pandas as pd

In [2]:
series = pd.Series([1,3,5,6,8])
series

0    1
1    3
2    5
3    6
4    8
dtype: int64

In [3]:
data = {
    'apples':[3, 2, 0, 1],
    'oranges':[0, 3, 7, 2], 
    'pears':[2, 4, 6, 8]
}
fruits = pd.DataFrame(data)
fruits

   apples  oranges  pears
0       3        0      2
1       2        3      4
2       0        7      6
3       1        2      8

In [4]:
buyer = pd.DataFrame(data, index=['Tom','Isabele','Daisy', 'Blathers'])
buyer

          apples  oranges  pears
Tom            3        0      2
Isabele        2        3      4
Daisy          0        7      6
Blathers       1        2      8

In [5]:
buyer.loc['Tom']

apples     3
oranges    0
pears      2
Name: Tom, dtype: int64